//构造和析构函数
#include <iostream>
using namespace std;
//对象的初始化(出厂设置)和清理

class Person
{
public:
    //1、构造函数
    //没有返回值  不用写void
    //函数名与类名相同
    //构造函数可以有参数，可以发生重载
    //构造对象的时候，构造函数会自动调用，而且只调用一次
Person()
{
    cout<<"Person的构造函数的调用"<<'\n';
}
    //2、析构函数
    //没有返回值  不用写void
    //函数名与类名相同  在名称前加~
    //构造函数不可以有参数，不可以发生重载
    //对象在销毁前，析构函数会自动调用，而且只调用一次
~Person()
{
    cout<<"Person的析构函数调用"<<'\n';
}
};

//构造和析构都是必须有的实现，如果我们自己不提供，编译器会提供一个空实现的构造和析构
void test01()
{
    Person p;  //在栈上的数据，test执行完毕后，释放这个对象  
}

int main(){
    //test01();
    Person P;  //此时未执行完main只会出现构造函数的调用，再按任意键后会闪过一个析构函数的调用

    return 0;
}